{"/contact":{"title":"Contact","data":{"email-us#Email Us":"If you are interested in collaborating with us or would like to learn more about our reseach projects, please feel free to contact us at zahra[dot]shakeri[@]utoronto[dot]ca. If you are interested in joining HIVE Lab, we are always looking for motivated and talented individuals. Open positions are listed on our Open Positions page. We welcome applications from all backgrounds.","visit-us#Visit Us":"HIVE Lab is in the Institute of Health Policy, Management and Evaluation (IHPME), Dalla Lana School of Public Health at the University of Toronto.\nUniversity of Toronto\nHealth Sciences Building\n155 College St\n4th Floor\nToronto, ON M5T 3M6"}},"/events":{"title":"Events","data":{}},"/events/e2025_oct_Beyond-The-Algorithm-Event":{"title":"Beyond the Algorithm: Human Factors at the Heart of AI in Healthcare","data":{"":"Date: Tuesday November 4th\nWhere: In Person, Data Sciences Institute (700 University Ave, 10th Floor)\nWhen: 4:30-6:30PM\nMethod: In Person Only\nNote: This event is not CPD accredited","overview#Overview":"Artificial intelligence (AI) promises to transform healthcare delivery, but its success depends as much on its users as on the algorithms. This keynote and workshop explores critical human factors that shape the adoption and effective use of AI in clinical settings. From cognitive biases and workflow integration to professional autonomy and collaboration, we will discuss why understanding human behaviour is essential for realising the potential of AI without compromising patient safety or care quality.\nThis workshop is funded through institutional grants from the University of Toronto and University College London. Space is limited to 40 attendees. Food and light refreshments will be provided.","agenda#Agenda":"Time\tActivity\t4:00-4:30PM\tRegistration at 700 University Ave, 10th Floor\t4:30-5:00PM\tKeynote by Prof. Susanne Gaube\t5:00-6:30PM\tWorkshop with Participants","about-prof-susanne-gaube#About Prof. Susanne Gaube":"Dr. Susanne Gaube is a Lecturer (Assistant Professor) in Human Factors in Healthcare at UCL's Global Business School for Health (GBSH). Her research focuses on (a) identifying opportunities in healthcare that could benefit from the introduction of digital technologies, (b) understanding the support needs of healthcare providers and patients and optimal ways to implement digital health technologies, and (c) improving the interaction between users and technology with a particular focus on Radiology, Infection Prevention and Control, and Mental Health. She also investigates how AI-enabled clinical decision support systems influence decision-making and proposes strategies to enhance human-AI collaboration.","organizers#Organizers":"HIVE Lab –  Health Informatics, Visualization, and Equity at the Institute of Health Policy, Management and Evaluation\nData Sciences Institute (DSI), University of Toronto\nTemerty Centre for AI Research and Education in Medicine (T-CAIREM), University of Toronto","registration--access#Registration & Access":"Apply to Participate by October 27th: Register here","contact#Contact":"For questions, please contact konrad[dot]samsel[@]mail[dot]utoronto[dot]ca.Last updated: October 10, 2025"}},"/":{"title":"Hive lab","data":{}},"/position":{"title":"Position","data":{"":"Join our HIVE!\nThank you for your interest in joining our team! We are always happy to hear from motivated students, postdocs, and researchers interested in seeing if HIVE lab might be the right place for them. Please contact zahra[dot]shakeri[@]utoronto[dot]ca for more details or read more about what we do on the Project page.Requirements: While proficiency in all these areas is beneficial, it is not a strict requirement. We value a diverse range of experiences and skill sets, and we encourage all interested candidates to apply. We are particularly interested in candidates with a keen interest in health informatics, AI, machine learning, natural language processing, or information visualization. Candidates with a degree in computer science, data science, public health, or a related field are preferred, though it is not mandatory. We also look for candidates with programming skills, excellent analytical and problem-solving abilities, the capacity to work both independently and collaboratively within a team, strong written and verbal communication skills, a passion for health equity, a commitment to contributing to meaningful research, and the ability to commit to a regular, consistent schedule.\nPostdoctoral\nIf you are interested in pursuing a postdoctoral position with our lab and meet the general requirements, we will need to collaborate on securing funding through postdoctoral scholarships, unless a funded position is announced through a special hiring call. In the absence of such a call, please consider planning for available funding opportunities. If your application is successful, we would be delighted to welcome you to our team. Ensure you are aware of both internal and external deadlines for each opportunity and communicate your plans with me at least three months prior to the deadline.\nBanting Postdoctoral Fellowships Program\nProvost's Postdoctoral Fellowship Program​\nSchmidt Science Fellows Award\nData Sciences Institute Postdoctoral Fellowship\nVector Institute Postdoctoral Scholarship\nChina Scholarship Council\nFull-time Graduate Students","full-time-graduate-students-fall-2026-intake-closed#Full-time Graduate Students: Fall 2026 Intake [Closed]":"HIVE Lab is no longer accepting applications for Fall 2026, as the department deadline has passed and we cannot accommodate new applications. Please consider applying for the Fall 2027 intake, which is expected to be due around November 2026.\nWe are a collaborative team working at the intersection of health informatics, artificial intelligence, and data visualization, dedicated to precision public health and health equity.","what-we-look-for#What We Look For":"Proven research experience shown through publications, conference papers, or substantial projects\nExceptional academic writing skills and the ability to explain complex ideas clearly\nStrong discipline and time-management to meet project milestones and publication deadlines\nInterest in grant writing or experience preparing funding proposals\nTechnical depth in at least one of the following: machine learning, natural language processing, data science, or information visualization\nAbility to work independently and as part of an interdisciplinary team\nGenuine enthusiasm for improving public and population health through data-driven methods","why-join-hive-lab#Why Join HIVE Lab":"Work on high-impact projects that influence health policy and patient outcomes\nAccess to rich datasets, cutting-edge computational resources, and dedicated mentorship\nOpportunities to co-author peer-reviewed papers, present at major conferences, and lead grant submissions\nA supportive environment that values diverse perspectives and encourages professional growth","how-to-apply#How to Apply":"CV and unofficial transcripts\nWriting sample (published paper, thesis chapter, or technical report)\nEmail your application as a single PDF to zahra[dot]shakeri[at]utoronto[dot]ca with the subject line\n“Fall 2027 Graduate Application–[Your Name]”.We look forward to connecting with you and learning more about your interests in the future. Thank you for considering us in your academic journey!\nPart-time Graduate Students\nFor part-time candidates, we are exclusively accepting applications for our self-funded MSc programs. We welcome applicants from diverse backgrounds, including clinical, epidemiology, and computer science, who are interested in applying novel data science techniques in their fields. Positions for part-time MSc students are available for Fall 2027.\n Volunteers and Practicum Students \nThank you for your interest in our Summer 2026 positions. At this time, we do not have any openings for the summer term. However, we encourage those interested in volunteer Research Assistant or internship opportunities to consider applying for the Fall 2026 term. Please feel free to reach out after mid-April. Thank you again for your interest, and we hope to potentially collaborate in the future."}},"/projects":{"title":"Projects","data":{}},"/projects/ai_for_enhanced_healthcare_services":{"title":"AI for Enhanced Healthcare Services","data":{"":"Intelligent solutions for better healthcare"}},"/projects/ai_image_data_innovations":{"title":"AI Image Data Innovations","data":{"":"Advancing analysis with AI imaging"}},"/projects/ai_learning_platforms_development":{"title":"AI Learning Platforms Development","data":{"":"Developing expertise in AI education"}},"/projects/ai_mental_health_solutions":{"title":"AI Mental Health Solutions","data":{"":"Innovative AI approaches to mental health"}},"/projects/ai_predictive_diabetes_insights":{"title":"AI Predictive Diabetes Insights","data":{"":"AI deciphers complex diabetes dynamics"}},"/publication":{"title":"Publication","data":{}},"/team":{"title":"Team","data":{}},"/team/amirhosein_rostami":{"title":"AmirHosein Rostami","data":{"":"AmirHosein Rostami is a Master's student in Artificial intelligence at the Dalla Lana School of Public Health, University of Toronto. He received his bachelor's degrees in Computer Science and Electrical Engineering from Sharif University of Technology. His research centers on software system design, blockchain, machine learning, MLOps, and health informatics."}},"/team/amirhossein_haji":{"title":"AmirHossein Haji Mohammad Rezaei","data":{"":"AmirHossein is an MSc student in the HSR-AI program at IHPME, Dalla Lana School of Public Health, University of Toronto, beginning Fall 2025. He is a recipient of the Vector Institute Artificial Intelligence Scholarship. His research interests include machine learning, foundation models, and the application of large language models (LLMs) in public health and clinical decision-making."}},"/team/aria_panchal":{"title":"Aria Panchal","data":{"":"Aria is a fourth-year undergraduate student at the University of Toronto with a double major in Physiology & Health and Disease. She is deeply passionate about holistic health and has over 3 years of experience in translational research. She has previously contributed to projects on oncological research to develop a cancer-preventive diet, conducted sleep studies to improve outcomes for apnea patients, and nutritional policy research to create Canada's first national school-food program. With a focus on data-driven decision-making and scientific communications, she hopes to engage in further health informatics projects that will help take healthcare to scale. Outside of the classroom, Aria is part of a competitive dance team and also hosts free dance classes to connect with UofT's vibrant student community."}},"/team/aseel_bahakim":{"title":"Aseel Bahakim","data":{"":"Aseel Bahakim holds a B.Sc. in Computer Science from King Abdulaziz University, specializing in software engineering. She is currently an AI intern at KAUST and is contributing to a project at HIVE Lab focused on evaluating sycophancy and bias in large language models. Her applied AI experience includes projects on solar panel fault detection using UAVs and a driver drowsiness detection system. She is particularly interested in AI governance, responsible AI, and the design of secure and reliable systems. Her work explores how AI systems behave in high-stakes and sensitive contexts, with a focus on developing technologies that are both trustworthy and secure. In her free time, Aseel enjoys biking, reading, and writing."}},"/team/chris_dharma":{"title":"Chris Dharma","data":{"":"Chris is a postdoctoral fellow with the Data Science Institute (DSI) at the University of Toronto.\r\nHe was a Vanier Canada Graduate Scholar during his doctoral studies.\r\nHe has worked, collaborated, and studied at numerous institutions such as ICES, Center for Addiction and Mental Health (CAMH),\r\nPublic Health Agency of Canada (PHAC), Western University, University of Toronto, and Columbia University.\r\nWith a background in epidemiology and applied biostatistics, he has a wealth of experience working with large administrative datasets, longitudinal primary data, and survey data. He has had up to 50 publications across diverse methodologies and applied topics, utilizing techniques from artificial intelligence (AI), machine learning, psychometrics, propensity scores, multiple imputation, and quantitative bias analysis.\r\nHis research spans critical areas such as mental health, sexual health, psychiatry, cardiovascular disease, and health services delivery.\r\nHe has worked with numerous marginalized communities, including sexual and gender minorities, unhoused individuals, and people with severe mental illness. Passionate about enhancing statistical methods, AI, and mental health, Chris aims to focus on harnessing generative AI and Natural Language Processing to leverage existing structured and unstructured data and promote health across all communities."}},"/team/davey_seeman":{"title":"Davey Seeman","data":{"":"Davey Seeman is a 2nd-year undergraduate student studying computer science and mathematics at Cornell University. Davey is most interested in the fields of natural language processing (NLP) and computer vision (CV). On one hand, Davey is fascinated by the theory behind NLP and CV architectures. But he also enjoys contemplating how these architectures can be applied to solve real-world problems in a new way. Currently, he is working at the Center for Teaching Innovation at Cornell University, where he is creating AI tools to assist professors in teaching their courses. He is also collaborating with Professor Miel Hostens to develop a CV model that determines the needs of a herd of cows using video recordings of those cows. In his time off, Davey usually browses Spotify to discover new songs. He loves showing off his song discoveries to his friends with similar music tastes."}},"/team/erica_zhang":{"title":"Qian(Erica) Zhang","data":{"":"Erica holds a B.Sc. in Mathematics & Its Applications from University of Toronto and an M.A. in Statistics from Columbia University. Experienced in model development, statistical analysis, and handling numerical, image, and textual datasets, she is passionate about cross-disciplinary research that drives practical solutions to real-world health challenges."}},"/team/fang_sheng":{"title":"Fang Sheng","data":{"":"Fang Sheng is an undergraduate student at the University of Toronto trained in bioinformatics and computational genomics, where he developed several predictive and generative models, including a diffusion-based antimicrobial peptide generator and a battery-survival model.\nAt the HIVE Lab, his interests have shifted toward medical LLM safety. His current work examines how large language models navigate potential risks in clinical prompts and adjust their internal reasoning toward safer responses. He enjoys thinking about AI reliability and the future of AI-supported healthcare.\nOutside of research, he loves spending time with his energetic Abyssinian cat, Lambo, who enthusiastically supervises his coding sessions."}},"/team/gabriel_you":{"title":"Gabriel You","data":{"":"Gabriel is a third year undergraduate student studying computer science and bioinformatics. His interests lie in machine learning and the applications of computing techniques in human health. In his time off, he likes to cook mostly edible food, volunteer in his community and spend time with his dogs."}},"/team/hemn_khdr":{"title":"Hemn Khdr","data":{"":"Hemn holds an MA in Economics from the University of Ottawa, where his research examined the socioeconomic and mental health determinants of academic performance using university admissions data. His background in economics highlighted the central role of technological innovation in driving growth and productivity, which inspired him to pursue a PhD at the University of Toronto focused on AI-powered innovations in healthcare. He is particularly interested in applying advanced machine learning models to electronic health record (EHR) data to predict patient outcomes and drive more supportive, patient-centered digital care."}},"/team/javier_ledo":{"title":"Javier Mencia Ledo","data":{"":"Javier is an MSc student in Biotatistics at the Dalla Lana School of Public Health at the University of Toronto (UofT). He obtained his bachelor's degree in Statistics and Mathematics also from UofT. His research centers in the applications of machine learning and causal inference to risk prediction for chronic conditions."}},"/team/juan_medina":{"title":"Juan Medina","data":{"":"Juan is a student in the MSc Health Systems Research (Health Systems AI Emphasis) program at IHPME. He has a multidisciplinary background in Economics, the Science in Society Program (Sociology, Neuroscience, Health & Technology Studies), and quantitative methods. His research focuses on leveraging machine learning towards disparity analysis and the development of more equitable policy solutions, particularly relating to long COVID."}},"/team/konrad_samsel":{"title":"Konrad Samsel","data":{"":"Konrad is a graduate epidemiology student and a 2024 AI for Public Health Trainee researching the use of NLP models to improve population health. During his previous undergraduate studies, he focused his research on better incorporating patient perspectives in healthcare decision-making, leading technical and knowledge mobilization projects on this topic. He is a former laboratory instructor at the Faculty of Medicine, and has contributed to projects at the Engineering Hatchery, School of Cities, and Institute for Biomedical Engineering. He enjoys keeping up to date on topics related to digital health, AI ethics, and health policy."}},"/team/kynthia_ravikumar":{"title":"Kynthia Ravikumar","data":{"":"Kynthia Ravikumar is a 5th year Medical student, and holds a Bachelor of Science in Global Health, from Imperial College London, United Kingdom. As a Research Assistant at the HIVE Lab, she is currently investigating sycophancy in large language models - exploring how these systems adjust their outputs in response to user opinions and the implications this has for clinical safety and decision-making.Her broader academic interests lie in the real-world deployment of AI in healthcare, with a particular focus on how these technologies shape the doctor-patient relationship, affect soft skills, and influence power dynamics. In a previous project in rural India, she examined how an AI chatbot used by community health workers impacted maternal health consultations - combining reflexive thematic analysis with the Calgary-Cambridge model to evaluate communication quality.Beyond her research, Kynthia is active in health policy and advocacy. She received the Inspire GP award for her exceptional contribution as President of the General Practice Society, and successfully passed policy on immigrant mental health as British Medical Association Representative for Imperial. She is also the Founder of Polygeia Imperial, a Global Health thinktank, where she co-authors research reports on the economic empowerment of woman following contraceptive use, and the impact of children’s handwashing on diarrhoea, undernutrition and pneumonia prevention.Kynthia hopes to continue bridging clinical practice, research, and technology to reimagine a more inclusive and ethically grounded future for healthcare."}},"/team/mark_dayomi":{"title":"Mark Dayomi","data":{"":"With a foundation in biology, statistics, and health sciences from his undergraduate studies, combined with practical experience in data science, Mark is deeply committed to using technology to advance precision and preventative medicine.\nIn his leisure time, he enjoys exploring cutting-edge tech trends, investing in stocks, and serving as a part-time tutor."}},"/team/marva_sharifi":{"title":"Marwa Sharifi","data":{"":"Marwa holds a Bachelor of Science in Molecular Biology, Immunology, and Disease from the University of Toronto. She has worked across both clinical and laboratory research environments and is deeply interested in public health policy research, drawn by its potential to drive equitable, system-wide improvements in healthcare access and outcomes. She enjoys working with data and sees it as a key part of understanding real-world issues and helping shape better policies."}},"/team/minh_le":{"title":"Minh Le","data":{"":"Minh Le is a Computer Science undergraduate at the University of Toronto. He is exploring how machine learning can enrich clinical and personal health systems, drawing on human‑computer interaction, health informatics, computer vision, and natural language processing. He believes that multimodal models can enable more holistic healthcare, and he aims to ensure these systems are both technically sound and human‑centered before they reach real‑world deployment."}},"/team/neil_seeman":{"title":"Neil Seeman","data":{"":"Neil Seeman specializes in innovations that empower healthcare experts, data, and evidence-based ideas in public health to deliver positive and sustained system-level impact. At the University of Toronto, he teaches at the Dalla Lana School of Public Health, and is a senior fellow in the Institute of Health Policy, Management and Evaluation, The Fields Institute for Research in Mathematical Sciences, Massey College, and the Investigative Journalism Bureau. His work in the private and public sector has specialized in Big Data and inclusive data: how to hear from the voices of people traditionally left out of surveys and decision-making. He champions post-partisan approaches to solving complex public health challenges and the use of complementary datasets for public policy. Neil is a regular contributor to Nikkei Asia, The Toronto Star, and Healthcare Quarterly. He has published his research on mental health topics in Nature, Synapse, and in other leading academic journals. Neil was founder and director of the Health Strategy Innovation Cell at the University of Toronto. He is the recipient of major research grants, including a New Frontiers in Research Fund (NFRF) grant awarded through Canada’s three federal research agencies: the SSHRC, the Canadian Institutes of Health Research (CIHR) and the Natural Sciences and Engineering Research Council (NSERC). He is the co-author of three books on mental health, including \"XXL: Obesity and the Limits of Shame,\" which was a finalist for the Donner Book Prize and was selected as an “outstanding” title by the University Press Books Committee. He is the author, most recently, of \"Accelerated Minds: Unlocking the Fascinating, Inspiring, and Often Destructive Impulses that Drive the Entrepreneurial Brain,\" published in May 2023 by Sutherland House Books. Neil is a graduate of the University of Toronto Law School (JD) and the Harvard T.H. Chan School of Public Health (MPH)."}},"/team/omid_jafarinezhad":{"title":"Omid Jafarinezhad","data":{"":"Omid Jafarinezhad is a passionate PhD student in Health Informatics at the University of Toronto,\ndriven by a profound curiosity for exploring the intersection of healthcare and technology.\nHis journey in software engineering began during his undergraduate studies, where he focused on improving his programming skills and delving into software engineering principles.\nDuring this time, Omid's interests gravitated towards tools that could enhance developer productivity, such as refactoring,\nautomated code generators, and systems enforcing best practices. Upon entering the industry post-graduation,\nhe gained hands-on experience as a software engineer, crafting data-intensive applications for desktop, web, and mobile platforms.\nThis real-world exposure exposed him to the complexities and challenges inherent in software development,\nsparking a desire to deepen his understanding of industry issues and potential solutions.\nMotivated by this, he pursued further education at Sharif University of Technology,\nconducting research under the supervision of Dr. Raman Ramsin.\nHere, he explored a software product line approach leveraging fuzzy logic for situation-based software processes.Throughout his professional trajectory spanning over two decades, he’s led multidisciplinary teams and innovative projects.\nFrom his role as a tech lead at RayaCell, developing impactful mobile applications, to serving as CTO at VADA, developing and maintaining\na high-traffic transaction platform, and then leading tailored software development at Nopayar,\nhe has consistently pursued opportunities to innovate and make a meaningful impact in the software industry."}},"/team/pardis_zahraei":{"title":"Pardis Sadat Zahraei","data":{"":"Pardis Sadat Zahraei is an undergraduate student studying Computer Engineering at Sharif University of Technology. She has a strong interest in Computational Linguistics and Natural Language Processing, with a particular focus on the evaluation of large language models. Pardis is passionate about exploring how these models work and identifying ways to improve their performance and usefulness. Her goal is to contribute to the development of AI systems that are ethical, transparent, and beneficial to society. Outside of her academic interests, Pardis enjoys reading fantasy novels and is a longtime fan of The Lord of the Rings series. She is always eager to learn about the latest advancements in NLP and to engage in thoughtful discussions."}},"/team/pourya_momtaz":{"title":"Pourya Momtaz","data":{"":"Pourya Momtaz is an aspiring AI enthusiast currently pursuing his MSc in \"AI in Health Systems.\" He obtained his bachelor's degree in computer engineering from Sharif University of Technology, where he delved into research in medical imaging, particularly in creating interpretable classification models for cancerous tissue images. Presently, Pourya is immersed in the world of clinical text data, employing Natural Language Processing (NLP) techniques.\nHis vision is to become a renowned academic researcher known for pivotal contributions to public health projects. Pourya is committed to developing products that revolutionize healthcare systems worldwide, making them more efficient and effective. With a strong background in computer engineering and a passion for AI in healthcare, he is poised to be a key player in advancing global healthcare technology."}},"/team/priyonto_saha":{"title":"Priyonto Saha","data":{"":"Interested in multidisplinary research with real-world impact. Completed his BMath at the University of Waterloo with a triple major in Biostatistics, Computational Mathematics, and Combinatorics & Optimization in 2023 and is currently working on his MSc in Biostatistics (Emphasis in Data Science/AI) at the Dalla Lana School of Public Health."}},"/team/rama_mohammed_alyoubi":{"title":"Rama Mohammed Alyoubi","data":{"":"I hold a degree in Artificial Intelligence and am currently working as a Research Assistant at HIVE Lab. My goal is to become a skilled Full-Stack AI Engineer, innovating solutions for complex real-world challenges."}},"/team/ryan_rezai":{"title":"Ryan Rezai","data":{"":"Ryan Rezai is an undergraduate engineering student at the University of Waterloo. He is interested in how intelligent systems learn and in how these systems can be deployed most effectively. This has led him to research  experiences in computer vision, natural language processing, reinforcement learning, interpretability, robotics, and sensors. Because of the importance and sensitivity of healthcare, he is most attracted to health applications: models trained on medical images and/or clinical text. He sees the implementation of massive multi-modal models as inevitable, and would like to guarantee their reliability and robustness before deployment."}},"/team/sepehr_harfi":{"title":"Sepehr Harfi","data":{"":"Sepehr is an MSc student in the HSR-AI program at IHPME, Dalla Lana School of Public Health, University of Toronto, beginning Fall 2025. Sepehr is a recipient of the Vector Institute Artificial Intelligence Scholarship. Sepehr's research interests include multimodal learning and its applications in public health and clinical decision-making."}},"/team/shveta_bhasker":{"title":"Shveta Bhasker","data":{"":"Shveta Bhasker is a Master of Health Informatics (MHI) student at the University of Toronto's Dalla Lana School of Public Health and the Institute of Health Policy, Management and Evaluation. The MHI degree is an artificial intelligence (AI) related master’s program recognized by the Vector Institute. Shveta is a published researcher. She is interested in the intersection between health informatics and social determinants of health while incorporating an equity, diversity, and inclusion (EDI) mindset. Shveta likes to read, write, and run in her free time."}},"/team/somayeh_amini":{"title":"Somayeh Amini","data":{"":"Somayeh is a first-year Master of Health Informatics (MHI) student at IHPME, Dalla Lana School of Public Health. She holds a PharmD degree and, as a pharmacist, worked in different management and leadership positions in community pharmacies and pharmaceutical companies back in Iran, her home country, during the past few years.\nShe started the MHI program to pursue her dream of becoming an impactful health informatician, harnessing the power of technology to help provide patients with better care and experience. She is passionate about AI/ML deployment in helping cancer patients in the palliative care setting, especially those in hospice/end-of-life care. She believes health informatics could provide her with the necessary knowledge and skills to bridge the gap and improve these patients' care and outcomes, including their survival, quality of life, treatment costs, etc."}},"/team/tony_":{"title":"Shengjie Zou","data":{"":"Shengjie(Tony) Zou is a recent graduate with a double major in Computer Science and Applied Statistics. Shengjie have experience in game market research, data analysis, and video game design. Familiar with programming languages like C/C++, JavaScript, and Python, and experience with game engines like Unity, Shengjie has a keen ability to bring creative ideas to fruition. Alongside academic pursuits, Shengjie has a passion for esports, fencing, and international ballroom dancing."}},"/team/yacine_marouf":{"title":"Yacine Marouf","data":{"":"Yacine is an MSc student in Biostatistics at the University of Toronto with a background in Biomedical Science from the University of Ottawa. He is proficient in R, Python, and is deeply committed to leveraging advanced statistical and machine learning methodologies to drive impactful research in healthcare. Currently, he contributes to projects at the HIVE lab and the University of Toronto department of Medicine, where he focuses on understanding healthcare disparities and evaluating emerging technologies. Thanks to his background in statistics and health science, he brings a diverse skill set and a passion for innovation to every endeavor and aim to make meaningful contributions to the field of biostatistics and healthcare research."}},"/team/yong_chen":{"title":"Yong Chen","data":{"":"During his time at HIVE Lab, Yong was a Statistics Student in his senior year at the University of Toronto Scarborough, with a specialization in machine learning and data mining. He possesses a year of experience in data analysis, visualization, and resolving real-world data issues through machine learning algorithms. He has a keen interest in learning different machine learning algorithms and simplifying complex problems. In his spare time, he enjoys walking dogs, watching movies, and exploring various experiences that the world has to offer."}},"/team/zahra_shakeri":{"title":"Zahra Shakeri","data":{"":"Dr. Zahra Shakeri is the NSERC Tier II Canada Research Chair in Precision Public Health and Health Informatics and an Assistant Professor of Health Informatics and Information Visualization at the Institute of Health Policy, Management and Evaluation, Dalla Lana School of Public Health, University of Toronto. She holds cross-appointments with the Faculty of Information and the Schwartz Reisman Institute for Technology and Society, University of Toronto.In 2022 Dr. Shakeri founded the Health Informatics, Visualization, and Equity (HIVE) Lab, which develops responsible artificial intelligence for public health, clinical decision support, and data-driven storytelling that advances health equity. Her research program integrates natural language processing, information visualization, AI safety, causal inference, and social media analytics to create patient-centred digital health solutions. Dr. Shakeri earned her PhD in Computer Science from the University of Calgary and completed postdoctoral training in the Gehlenborg Lab, Department of Biomedical Informatics, Harvard Medical School."}},"/team/zhenxioa_yang":{"title":"Zhenxiao Yang","data":{"":"Zhenxiao is an MSc student in Health System Research at IHPME, Dalla Lana School of Public Health, University of Toronto. He also works as a clinical research assistant at the University Health Network, where he develops and evaluates large language model to identify social determinants of health from electronic health records and support integrated care for complex patients. His research interests include natural language processing, precision public health, and the use of AI to improve equity and patient experience in hospital-to-home transitions. Outside of research, he is a car enthusiast and recently started playing pickleball!"}},"/team/ziqi_shu":{"title":"Ziqi Shu","data":{"":"Ziqi Shu graduated with degrees in Cognitive Science and Computer Science from the University of Toronto. She is interested in applying computational models to study human cognition and various topics in Computational Linguistics. In her spare time, Ziqi enjoys watching musicals, petting cats, and sleeping. During her time at the HIVE Lab, she contributed to a project that utilized Machine Learning and AI to predict school dropout rates, in collaboration with UNICEF and the Data Science Institute at the University of Toronto."}}}