{"/contact":{"title":"Contact","data":{"email-us#Email Us":"If you are interested in collaborating with us or would like to learn more about our reseach projects, please feel free to contact us at zahra[dot]shakeri[@]utoronto[dot]ca. If you are interested in joining HIVE Lab, we are always looking for motivated and talented individuals. Open positions are listed on our Open Positions page. We welcome applications from all backgrounds.","visit-us#Visit Us":"HIVE Lab is in the Institute of Health Policy, Management and Evaluation (IHPME), Dalla Lana School of Public Health at the University of Toronto.\nUniversity of Toronto\nHealth Sciences Building\n155 College St\n4th Floor\nToronto, ON M5T 3M6"}},"/":{"title":"Hive lab","data":{}},"/position":{"title":"Position","data":{"":"Join our HIVE!\nThank you for your interest in joining our team! We are always happy to hear from motivated students, postdocs, and researchers interested in seeing if HIVE lab might be the right place for them. Please contact zahra[dot]shakeri[@]utoronto[dot]ca for more details or read more about what we do on the Project page.Requirements: While proficiency in all these areas is beneficial, it is not a strict requirement. We value a diverse range of experiences and skill sets, and we encourage all interested candidates to apply. We are particularly interested in candidates with a keen interest in health informatics, AI, machine learning, natural language processing, or information visualization. Candidates with a degree in computer science, data science, public health, or a related field are preferred, though it is not mandatory. We also look for candidates with programming skills, excellent analytical and problem-solving abilities, the capacity to work both independently and collaboratively within a team, strong written and verbal communication skills, a passion for health equity, a commitment to contributing to meaningful research, and the ability to commit to a regular, consistent schedule.\nPostdoctoral\nIf you are interested in pursuing a postdoctoral position with our lab and meet the general requirements, we will need to collaborate on securing funding through postdoctoral scholarships, unless a funded position is announced through a special hiring call. In the absence of such a call, please consider planning for available funding opportunities. If your application is successful, we would be delighted to welcome you to our team. Ensure you are aware of both internal and external deadlines for each opportunity and communicate your plans with me at least three months prior to the deadline.\nBanting Postdoctoral Fellowships Program\nProvost's Postdoctoral Fellowship Program​\nSchmidt Science Fellows Award\nData Sciences Institute Postdoctoral Fellowship\nVector Institute Postdoctoral Scholarship\nChina Scholarship Council\nFull-time Graduate Students\nThank you for your interest in HIVE Lab. Please note that we are not accepting applications for new MSc or PhD students for Fall 2025. However, we encourage you to stay updated as we may introduce new graduate positions for Fall 2026. We look forward to connecting with you and learning more about your interests in the future. Thank you for considering us in your academic journey!\nPart-time Graduate Students\nFor part-time candidates, we are exclusively accepting applications for our self-funded MSc programs. We welcome applicants from diverse backgrounds, including clinical, epidemiology, and computer science, who are interested in applying novel data science techniques in their fields. Positions for part-time MSc students are available for Fall 2025.\n Volunteers and Practicum Students \nThank you for your interest in our Winter 2025 positions. At this time, we do not have any openings for the winter term. However, we encourage those interested in volunteer Research Assistant or internship opportunities to consider applying for the Spring 2025 term. Please feel free to reach out after mid-April. Thank you again for your interest, and we hope to potentially collaborate in the future."}},"/projects":{"title":"Projects","data":{}},"/projects/ai_for_enhanced_healthcare_services":{"title":"AI for Enhanced Healthcare Services","data":{"":"Intelligent solutions for better healthcare"}},"/projects/ai_image_data_innovations":{"title":"AI Image Data Innovations","data":{"":"Advancing analysis with AI imaging"}},"/projects/ai_learning_platforms_development":{"title":"AI Learning Platforms Development","data":{"":"Developing expertise in AI education"}},"/projects/ai_mental_health_solutions":{"title":"AI Mental Health Solutions","data":{"":"Innovative AI approaches to mental health"}},"/projects/ai_predictive_diabetes_insights":{"title":"AI Predictive Diabetes Insights","data":{"":"AI deciphers complex diabetes dynamics"}},"/publication":{"title":"Publication","data":{}},"/team":{"title":"Team","data":{}},"/team/amirhosein_rostami":{"title":"AmirHosein Rostami","data":{"":"AmirHosein Rostami is a Master's student in Artificial intelligence at the Dalla Lana School of Public Health, University of Toronto. He received his bachelor's degrees in Computer Science and Electrical Engineering from Sharif University of Technology. His research centers on software system design, blockchain, machine learning, MLOps, and health informatics."}},"/team/amirhossein_haji":{"title":"AmirHossein Haji Mohammad Rezaei","data":{"":"AmirHossein is an MSc student in the HSR-AI program at IHPME, Dalla Lana School of Public Health, University of Toronto, beginning Fall 2025. He is a recipient of the Vector Institute Artificial Intelligence Scholarship. His research interests include machine learning, foundation models, and the application of large language models (LLMs) in public health and clinical decision-making."}},"/team/aria_panchal":{"title":"Aria Panchal","data":{"":"Aria is a fourth-year undergraduate student at the University of Toronto with a double major in Physiology & Health and Disease. She is deeply passionate about holistic health and has over 3 years of experience in translational research. She has previously contributed to projects on oncological research to develop a cancer-preventive diet, conducted sleep studies to improve outcomes for apnea patients, and nutritional policy research to create Canada's first national school-food program. With a focus on data-driven decision-making and scientific communications, she hopes to engage in further health informatics projects that will help take healthcare to scale. Outside of the classroom, Aria is part of a competitive dance team and also hosts free dance classes to connect with UofT's vibrant student community."}},"/team/davey_seeman":{"title":"Davey Seeman","data":{"":"Davey Seeman is a 2nd-year undergraduate student studying computer science and mathematics at Cornell University. Davey is most interested in the fields of natural language processing (NLP) and computer vision (CV). On one hand, Davey is fascinated by the theory behind NLP and CV architectures. But he also enjoys contemplating how these architectures can be applied to solve real-world problems in a new way. Currently, he is working at the Center for Teaching Innovation at Cornell University, where he is creating AI tools to assist professors in teaching their courses. He is also collaborating with Professor Miel Hostens to develop a CV model that determines the needs of a herd of cows using video recordings of those cows. In his time off, Davey usually browses Spotify to discover new songs. He loves showing off his song discoveries to his friends with similar music tastes."}},"/team/erica_zhang":{"title":"Qian(Erica) Zhang","data":{"":"Erica holds a B.Sc. in Mathematics & Its Applications from University of Toronto and an M.A. in Statistics from Columbia University. Experienced in model development, statistical analysis, and handling numerical, image, and textual datasets, she is passionate about cross-disciplinary research that drives practical solutions to real-world health challenges."}},"/team/gabriel_you":{"title":"Gabriel You","data":{"":"Gabriel is a third year undergraduate student studying computer science and bioinformatics. His interests lie in machine learning and the applications of computing techniques in human health. In his time off, he likes to cook mostly edible food, volunteer in his community and spend time with his dogs."}},"/team/juan_medina":{"title":"Juan Medina","data":{"":"Juan is a student in the MSc Health Systems Research (Health Systems AI Emphasis) program at IHPME. He has a multidisciplinary background in Economics, the Science in Society Program (Sociology, Neuroscience, Health & Technology Studies), and quantitative methods. His research focuses on leveraging machine learning towards disparity analysis and the development of more equitable policy solutions, particularly relating to long COVID."}},"/team/kamyar_kazari":{"title":"Kamyar Kazari","data":{"":"Kamyar is an MSc student in the HSR-AI program at IHPME, Dalla Lana School of Public Health, University of Toronto. He holds the Vector Artificial Intelligence Scholarship and AI4PH Scholarship for his work on applying AI to behavioral health and interventions.\nWith a keen interest in Artificial Intelligence, Machine Learning, and Algorithms, Kamyar’s academic journey is fueled by curiosity and a drive to explore the frontiers of these fields. Outside his studies, he enjoys music, exploring different genres, and playing the piano."}},"/team/konrad_samsel":{"title":"Konrad Samsel","data":{"":"Konrad is a graduate epidemiology student and a 2024 AI for Public Health Trainee researching the use of NLP models to improve population health. During his previous undergraduate studies, he focused his research on better incorporating patient perspectives in healthcare decision-making, leading technical and knowledge mobilization projects on this topic. He is a former laboratory instructor at the Faculty of Medicine, and has contributed to projects at the Engineering Hatchery, School of Cities, and Institute for Biomedical Engineering. He enjoys keeping up to date on topics related to digital health, AI ethics, and health policy."}},"/team/mark_dayomi":{"title":"Mark Dayomi","data":{"":"With a foundation in biology, statistics, and health sciences from his undergraduate studies, combined with practical experience in data science, Mark is deeply committed to using technology to advance precision and preventative medicine.\nIn his leisure time, he enjoys exploring cutting-edge tech trends, investing in stocks, and serving as a part-time tutor."}},"/team/marva_sharifi":{"title":"Marwa Sharifi","data":{"":"Marwa holds a Bachelor of Science in Molecular Biology, Immunology, and Disease from the University of Toronto. She has worked across both clinical and laboratory research environments and is deeply interested in public health policy research, drawn by its potential to drive equitable, system-wide improvements in healthcare access and outcomes. She enjoys working with data and sees it as a key part of understanding real-world issues and helping shape better policies."}},"/team/minh_le":{"title":"Minh Le","data":{"":"Minh Le is a Computer Science undergraduate at the University of Toronto. He is exploring how machine learning can enrich clinical and personal health systems, drawing on human‑computer interaction, health informatics, computer vision, and natural language processing. He believes that multimodal models can enable more holistic healthcare, and he aims to ensure these systems are both technically sound and human‑centered before they reach real‑world deployment."}},"/team/neil_seeman":{"title":"Neil Seeman","data":{"":"Neil Seeman specializes in innovations that empower healthcare experts, data, and evidence-based ideas in public health to deliver positive and sustained system-level impact. At the University of Toronto, he teaches at the Dalla Lana School of Public Health, and is a senior fellow in the Institute of Health Policy, Management and Evaluation, The Fields Institute for Research in Mathematical Sciences, Massey College, and the Investigative Journalism Bureau. His work in the private and public sector has specialized in Big Data and inclusive data: how to hear from the voices of people traditionally left out of surveys and decision-making. He champions post-partisan approaches to solving complex public health challenges and the use of complementary datasets for public policy. Neil is a regular contributor to Nikkei Asia, The Toronto Star, and Healthcare Quarterly. He has published his research on mental health topics in Nature, Synapse, and in other leading academic journals. Neil was founder and director of the Health Strategy Innovation Cell at the University of Toronto. He is the recipient of major research grants, including a New Frontiers in Research Fund (NFRF) grant awarded through Canada’s three federal research agencies: the SSHRC, the Canadian Institutes of Health Research (CIHR) and the Natural Sciences and Engineering Research Council (NSERC). He is the co-author of three books on mental health, including \"XXL: Obesity and the Limits of Shame,\" which was a finalist for the Donner Book Prize and was selected as an “outstanding” title by the University Press Books Committee. He is the author, most recently, of \"Accelerated Minds: Unlocking the Fascinating, Inspiring, and Often Destructive Impulses that Drive the Entrepreneurial Brain,\" published in May 2023 by Sutherland House Books. Neil is a graduate of the University of Toronto Law School (JD) and the Harvard T.H. Chan School of Public Health (MPH)."}},"/team/pardis_zahraei":{"title":"Pardis Sadat Zahraei","data":{"":"Pardis Sadat Zahraei is an undergraduate student studying Computer Engineering at Sharif University of Technology. She has a strong interest in Computational Linguistics and Natural Language Processing, with a particular focus on the evaluation of large language models. Pardis is passionate about exploring how these models work and identifying ways to improve their performance and usefulness. Her goal is to contribute to the development of AI systems that are ethical, transparent, and beneficial to society. Outside of her academic interests, Pardis enjoys reading fantasy novels and is a longtime fan of The Lord of the Rings series. She is always eager to learn about the latest advancements in NLP and to engage in thoughtful discussions."}},"/team/omid_jafarinezhad":{"title":"Omid Jafarinezhad","data":{"":"Omid Jafarinezhad is a passionate PhD student in Health Informatics at the University of Toronto,\ndriven by a profound curiosity for exploring the intersection of healthcare and technology.\nHis journey in software engineering began during his undergraduate studies, where he focused on improving his programming skills and delving into software engineering principles.\nDuring this time, Omid's interests gravitated towards tools that could enhance developer productivity, such as refactoring,\nautomated code generators, and systems enforcing best practices. Upon entering the industry post-graduation,\nhe gained hands-on experience as a software engineer, crafting data-intensive applications for desktop, web, and mobile platforms.\nThis real-world exposure exposed him to the complexities and challenges inherent in software development,\nsparking a desire to deepen his understanding of industry issues and potential solutions.\nMotivated by this, he pursued further education at Sharif University of Technology,\nconducting research under the supervision of Dr. Raman Ramsin.\nHere, he explored a software product line approach leveraging fuzzy logic for situation-based software processes.Throughout his professional trajectory spanning over two decades, he’s led multidisciplinary teams and innovative projects.\nFrom his role as a tech lead at RayaCell, developing impactful mobile applications, to serving as CTO at VADA, developing and maintaining\na high-traffic transaction platform, and then leading tailored software development at Nopayar,\nhe has consistently pursued opportunities to innovate and make a meaningful impact in the software industry."}},"/team/pourya_momtaz":{"title":"Pourya Momtaz","data":{"":"Pourya Momtaz is an aspiring AI enthusiast currently pursuing his MSc in \"AI in Health Systems.\" He obtained his bachelor's degree in computer engineering from Sharif University of Technology, where he delved into research in medical imaging, particularly in creating interpretable classification models for cancerous tissue images. Presently, Pourya is immersed in the world of clinical text data, employing Natural Language Processing (NLP) techniques.\nHis vision is to become a renowned academic researcher known for pivotal contributions to public health projects. Pourya is committed to developing products that revolutionize healthcare systems worldwide, making them more efficient and effective. With a strong background in computer engineering and a passion for AI in healthcare, he is poised to be a key player in advancing global healthcare technology."}},"/team/priyonto_saha":{"title":"Priyonto Saha","data":{"":"Interested in multidisplinary research with real-world impact. Completed his BMath at the University of Waterloo with a triple major in Biostatistics, Computational Mathematics, and Combinatorics & Optimization in 2023 and is currently working on his MSc in Biostatistics (Emphasis in Data Science/AI) at the Dalla Lana School of Public Health."}},"/team/ryan_rezai":{"title":"Ryan Rezai","data":{"":"Ryan Rezai is an undergraduate engineering student at the University of Waterloo. He is interested in how intelligent systems learn and in how these systems can be deployed most effectively. This has led him to research  experiences in computer vision, natural language processing, reinforcement learning, interpretability, robotics, and sensors. Because of the importance and sensitivity of healthcare, he is most attracted to health applications: models trained on medical images and/or clinical text. He sees the implementation of massive multi-modal models as inevitable, and would like to guarantee their reliability and robustness before deployment."}},"/team/sepehr_harfi":{"title":"Sepehr Harfi","data":{"":"Sepehr is an MSc student in the HSR-AI program at IHPME, Dalla Lana School of Public Health, University of Toronto, beginning Fall 2025. Sepehr is a recipient of the Vector Institute Artificial Intelligence Scholarship. Sepehr's research interests include multimodal learning and its applications in public health and clinical decision-making."}},"/team/shveta_bhasker":{"title":"Shveta Bhasker","data":{"":"Shveta Bhasker is a Master of Health Informatics (MHI) student at the University of Toronto's Dalla Lana School of Public Health and the Institute of Health Policy, Management and Evaluation. The MHI degree is an artificial intelligence (AI) related master’s program recognized by the Vector Institute. Shveta is a published researcher. She is interested in the intersection between health informatics and social determinants of health while incorporating an equity, diversity, and inclusion (EDI) mindset. Shveta likes to read, write, and run in her free time."}},"/team/somayeh_amini":{"title":"Somayeh Amini","data":{"":"Somayeh is a first-year Master of Health Informatics (MHI) student at IHPME, Dalla Lana School of Public Health. She holds a PharmD degree and, as a pharmacist, worked in different management and leadership positions in community pharmacies and pharmaceutical companies back in Iran, her home country, during the past few years.\nShe started the MHI program to pursue her dream of becoming an impactful health informatician, harnessing the power of technology to help provide patients with better care and experience. She is passionate about AI/ML deployment in helping cancer patients in the palliative care setting, especially those in hospice/end-of-life care. She believes health informatics could provide her with the necessary knowledge and skills to bridge the gap and improve these patients' care and outcomes, including their survival, quality of life, treatment costs, etc."}},"/team/tony_":{"title":"Shengjie Zou","data":{"":"Shengjie(Tony) Zou is a recent graduate with a double major in Computer Science and Applied Statistics. Shengjie have experience in game market research, data analysis, and video game design. Familiar with programming languages like C/C++, JavaScript, and Python, and experience with game engines like Unity, Shengjie has a keen ability to bring creative ideas to fruition. Alongside academic pursuits, Shengjie has a passion for esports, fencing, and international ballroom dancing."}},"/team/yacine_marouf":{"title":"Yacine Marouf","data":{"":"Yacine is an MSc student in Biostatistics at the University of Toronto with a background in Biomedical Science from the University of Ottawa. He is proficient in R, Python, and is deeply committed to leveraging advanced statistical and machine learning methodologies to drive impactful research in healthcare. Currently, he contributes to projects at the HIVE lab and the University of Toronto department of Medicine, where he focuses on understanding healthcare disparities and evaluating emerging technologies. Thanks to his background in statistics and health science, he brings a diverse skill set and a passion for innovation to every endeavor and aim to make meaningful contributions to the field of biostatistics and healthcare research."}},"/team/yong_chen":{"title":"Yong Chen","data":{"":"During his time at HIVE Lab, Yong was a Statistics Student in his senior year at the University of Toronto Scarborough, with a specialization in machine learning and data mining. He possesses a year of experience in data analysis, visualization, and resolving real-world data issues through machine learning algorithms. He has a keen interest in learning different machine learning algorithms and simplifying complex problems. In his spare time, he enjoys walking dogs, watching movies, and exploring various experiences that the world has to offer."}},"/team/zahra_shakeri":{"title":"Zahra Shakeri","data":{"":"Dr. Zahra Shakeri is an NSERC Canada Research Chair Tier II in Health Informatics and Precision Public Health and an Assistant Professor of Health Informatics and Information Visualization at the Institute of Health Policy, Management and Evaluation, Dalla Lana School of Public Health, University of Toronto. She established the HIVE Lab in July 2022 to lead research on AI for public health, clinical AI, and visual storytelling with data in public health. She earned her PhD in Computer Science from the University of Calgary and completed her postdoctoral training at Gehlenborg Lab in the Department of Biomedical Informatics at Harvard Medical School. Dr. Shakeri's research focuses on health informatics, natural language processing, information visualization, precision public health, digital health, and social media analysis."}},"/team/ziqi_shu":{"title":"Ziqi Shu","data":{"":"Ziqi Shu graduated with degrees in Cognitive Science and Computer Science from the University of Toronto. She is interested in applying computational models to study human cognition and various topics in Computational Linguistics. In her spare time, Ziqi enjoys watching musicals, petting cats, and sleeping. During her time at the HIVE Lab, she contributed to a project that utilized Machine Learning and AI to predict school dropout rates, in collaboration with UNICEF and the Data Science Institute at the University of Toronto."}}}